HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxEray_regdef.h
/**
 * \file IfxEray_regdef.h
 * \brief
 * \copyright Copyright (c) 2014 Infineon Technologies AG. All rights reserved.
 *
 * Version: TC27XA_TS_V3.0.1.R2
 * Specification: TC27xA_TS_V3.0.1_SFR_OPEN_MARKET.xml (Revision: V3.0.1)
 * MAY BE CHANGED BY USER [yes/no]: No
 *
 *                                 IMPORTANT NOTICE
 *
 * Infineon Technologies AG (Infineon) is supplying this file for use
 * exclusively with Infineon's microcontroller products. This file can be freely
 * distributed within development tools that are supporting such microcontroller
 * products.
 *
 * THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 * OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 * INFINEON SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL,
 * OR CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 * \defgroup IfxLld_Eray Eray
 * \ingroup IfxLld
 * 
 * \defgroup IfxLld_Eray_Bitfields Bitfields
 * \ingroup IfxLld_Eray
 * 
 * \defgroup IfxLld_Eray_union Union
 * \ingroup IfxLld_Eray
 * 
 * \defgroup IfxLld_Eray_struct Struct
 * \ingroup IfxLld_Eray
 * 
 */
#ifndef IFXERAY_REGDEF_H
#define IFXERAY_REGDEF_H 1
/******************************************************************************/
#include "Ifx_TypesReg.h"
/******************************************************************************/
/** \addtogroup IfxLld_Eray_Bitfields
 * \{  */

/** \\brief  Access Enable Register 0 */
typedef struct _Ifx_ERAY_ACCEN0_Bits
{
    unsigned int EN0:1;                     /**< \brief [0:0] Access Enable for Master TAG ID n (rw) */
    unsigned int EN1:1;                     /**< \brief [1:1] Access Enable for Master TAG ID n (rw) */
    unsigned int EN2:1;                     /**< \brief [2:2] Access Enable for Master TAG ID n (rw) */
    unsigned int EN3:1;                     /**< \brief [3:3] Access Enable for Master TAG ID n (rw) */
    unsigned int EN4:1;                     /**< \brief [4:4] Access Enable for Master TAG ID n (rw) */
    unsigned int EN5:1;                     /**< \brief [5:5] Access Enable for Master TAG ID n (rw) */
    unsigned int EN6:1;                     /**< \brief [6:6] Access Enable for Master TAG ID n (rw) */
    unsigned int EN7:1;                     /**< \brief [7:7] Access Enable for Master TAG ID n (rw) */
    unsigned int EN8:1;                     /**< \brief [8:8] Access Enable for Master TAG ID n (rw) */
    unsigned int EN9:1;                     /**< \brief [9:9] Access Enable for Master TAG ID n (rw) */
    unsigned int EN10:1;                    /**< \brief [10:10] Access Enable for Master TAG ID n (rw) */
    unsigned int EN11:1;                    /**< \brief [11:11] Access Enable for Master TAG ID n (rw) */
    unsigned int EN12:1;                    /**< \brief [12:12] Access Enable for Master TAG ID n (rw) */
    unsigned int EN13:1;                    /**< \brief [13:13] Access Enable for Master TAG ID n (rw) */
    unsigned int EN14:1;                    /**< \brief [14:14] Access Enable for Master TAG ID n (rw) */
    unsigned int EN15:1;                    /**< \brief [15:15] Access Enable for Master TAG ID n (rw) */
    unsigned int EN16:1;                    /**< \brief [16:16] Access Enable for Master TAG ID n (rw) */
    unsigned int EN17:1;                    /**< \brief [17:17] Access Enable for Master TAG ID n (rw) */
    unsigned int EN18:1;                    /**< \brief [18:18] Access Enable for Master TAG ID n (rw) */
    unsigned int EN19:1;                    /**< \brief [19:19] Access Enable for Master TAG ID n (rw) */
    unsigned int EN20:1;                    /**< \brief [20:20] Access Enable for Master TAG ID n (rw) */
    unsigned int EN21:1;                    /**< \brief [21:21] Access Enable for Master TAG ID n (rw) */
    unsigned int EN22:1;                    /**< \brief [22:22] Access Enable for Master TAG ID n (rw) */
    unsigned int EN23:1;                    /**< \brief [23:23] Access Enable for Master TAG ID n (rw) */
    unsigned int EN24:1;                    /**< \brief [24:24] Access Enable for Master TAG ID n (rw) */
    unsigned int EN25:1;                    /**< \brief [25:25] Access Enable for Master TAG ID n (rw) */
    unsigned int EN26:1;                    /**< \brief [26:26] Access Enable for Master TAG ID n (rw) */
    unsigned int EN27:1;                    /**< \brief [27:27] Access Enable for Master TAG ID n (rw) */
    unsigned int EN28:1;                    /**< \brief [28:28] Access Enable for Master TAG ID n (rw) */
    unsigned int EN29:1;                    /**< \brief [29:29] Access Enable for Master TAG ID n (rw) */
    unsigned int EN30:1;                    /**< \brief [30:30] Access Enable for Master TAG ID n (rw) */
    unsigned int EN31:1;                    /**< \brief [31:31] Access Enable for Master TAG ID n (rw) */
} Ifx_ERAY_ACCEN0_Bits;

/** \\brief  Access Enable Register 1 */
typedef struct _Ifx_ERAY_ACCEN1_Bits
{
    unsigned int reserved_0:32;             /**< \brief \internal Reserved */
} Ifx_ERAY_ACCEN1_Bits;

/** \\brief  Aggregated Channel Status */
typedef struct _Ifx_ERAY_ACS_Bits
{
    unsigned int VFRA:1;                    /**< \brief [0:0] Valid Frame Received on Channel A (vSS!ValidFrameA) (rwh) */
    unsigned int SEDA:1;                    /**< \brief [1:1] Syntax Error Detected on Channel A (vSS!SyntaxErrorA) (rwh) */
    unsigned int CEDA:1;                    /**< \brief [2:2] Content Error Detected on Channel A (vSS!ContentErrorA) (rwh) */
    unsigned int CIA:1;                     /**< \brief [3:3] Communication Indicator Channel A (rwh) */
    unsigned int SBVA:1;                    /**< \brief [4:4] Slot Boundary Violation on Channel A (vSS!BViolationA) (rwh) */
    unsigned int reserved_5:3;              /**< \brief \internal Reserved */
    unsigned int VFRB:1;                    /**< \brief [8:8] Valid Frame Received on Channel B (vSS!ValidFrameB) (rwh) */
    unsigned int SEDB:1;                    /**< \brief [9:9] Syntax Error Detected on Channel B (vSS!SyntaxErrorB) (rwh) */
    unsigned int CEDB:1;                    /**< \brief [10:10] Content Error Detected on Channel B (vSS!ContentErrorB) (rwh) */
    unsigned int CIB:1;                     /**< \brief [11:11] Communication Indicator Channel B (rwh) */
    unsigned int SBVB:1;                    /**< \brief [12:12] Slot Boundary Violation on Channel B (vSS!BViolationB) (rwh) */
    unsigned int reserved_13:19;            /**< \brief \internal Reserved */
} Ifx_ERAY_ACS_Bits;

/** \\brief  Communication Controller Error Vector */
typedef struct _Ifx_ERAY_CCEV_Bits
{
    unsigned int CCFC:4;                    /**< \brief [3:0] Clock Correction Failed Counter (vClockCorrectionFailed) (rh) */
    unsigned int reserved_4:2;              /**< \brief \internal Reserved */
    unsigned int ERRM:2;                    /**< \brief [7:6] Error Mode (vPOC!ErrorMode) (rh) */
    unsigned int PTAC:5;                    /**< \brief [12:8] Passive to Active Count (vAllowPassiveToActive) (rh) */
    unsigned int reserved_13:19;            /**< \brief \internal Reserved */
} Ifx_ERAY_CCEV_Bits;

/** \\brief  Communication Controller Status Vector */
typedef struct _Ifx_ERAY_CCSV_Bits
{
    unsigned int POCS:6;                    /**< \brief [5:0] Protocol Operation Control Status (rh) */
    unsigned int FSI:1;                     /**< \brief [6:6] Freeze Status Indicator (vPOC!Freeze) (rh) */
    unsigned int HRQ:1;                     /**< \brief [7:7] Halt Request (vPOC!CHIHaltRequest) (rh) */
    unsigned int SLM:2;                     /**< \brief [9:8] Slot Mode (vPOC!SlotMode) (rh) */
    unsigned int reserved_10:2;             /**< \brief \internal Reserved */
    unsigned int CSNI:1;                    /**< \brief [12:12] Coldstart Noise Indicator (vPOC!ColdstartNoise) (rh) */
    unsigned int CSAI:1;                    /**< \brief [13:13] Coldstart Abort Indicator (rh) */
    unsigned int CSI:1;                     /**< \brief [14:14] Cold Start Inhibit (vColdStartInhibit) (rh) */
    unsigned int reserved_15:1;             /**< \brief \internal Reserved */
    unsigned int WSV:3;                     /**< \brief [18:16] Wakeup Status (vPOC!WakeupStatus) (rh) */
    unsigned int RCA:5;                     /**< \brief [23:19] Remaining Coldstart Attempts (vRemainingColdstartAttempts) (rh) */
    unsigned int PSL:6;                     /**< \brief [29:24] POC Status Log (rh) */
    unsigned int reserved_30:2;             /**< \brief \internal Reserved */
} Ifx_ERAY_CCSV_Bits;

/** \\brief  Clock Control Register */
typedef struct _Ifx_ERAY_CLC_Bits
{
    unsigned int DISR:1;                    /**< \brief [0:0] Module Disable Request Bit (rw) */
    unsigned int DISS:1;                    /**< \brief [1:1] Module Disable Status Bit (rh) */
    unsigned int reserved_2:1;              /**< \brief \internal Reserved */
    unsigned int EDIS:1;                    /**< \brief [3:3] Sleep Mode Enable Control (rw) */
    unsigned int reserved_4:4;              /**< \brief \internal Reserved */
    unsigned int RMC:8;                     /**< \brief [15:8] 8-bit Clock Divider Value in RUN Mode (rw) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_ERAY_CLC_Bits;

/** \\brief  Core Release Register */
typedef struct _Ifx_ERAY_CREL_Bits
{
    unsigned int DAY:8;                     /**< \brief [7:0] Design Time Stamp, Day (r) */
    unsigned int MON:8;                     /**< \brief [15:8] Design Time Stamp, Month (r) */
    unsigned int YEAR:4;                    /**< \brief [19:16] Design Time Stamp, Year (r) */
    unsigned int SUBSTEP:4;                 /**< \brief [23:20] Sub-Step of Core Release (r) */
    unsigned int STEP:4;                    /**< \brief [27:24] Step of Core Release (r) */
    unsigned int REL:4;                     /**< \brief [31:28] Core Release (r) */
} Ifx_ERAY_CREL_Bits;

