HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxEray_regdef.h
/** \\brief  Message Buffer Status Changed 3 */
typedef struct _Ifx_ERAY_MBSC3_Bits
{
    unsigned int MBC64:1;                   /**< \brief [0:0] Message Buffer Status Changed n (n=64-95) (rh) */
    unsigned int MBC65:1;                   /**< \brief [1:1] Message Buffer Status Changed n (n=64-95) (rh) */
    unsigned int MBC66:1;                   /**< \brief [2:2] Message Buffer Status Changed n (n=64-95) (rh) */
    unsigned int MBC67:1;                   /**< \brief [3:3] Message Buffer Status Changed n (n=64-95) (rh) */
    unsigned int MBC68:1;                   /**< \brief [4:4] Message Buffer Status Changed n (n=64-95) (rh) */
    unsigned int MBC69:1;                   /**< \brief [5:5] Message Buffer Status Changed n (n=64-95) (rh) */
    unsigned int MBC70:1;                   /**< \brief [6:6] Message Buffer Status Changed n (n=64-95) (rh) */
    unsigned int MBC71:1;                   /**< \brief [7:7] Message Buffer Status Changed n (n=64-95) (rh) */
    unsigned int MBC72:1;                   /**< \brief [8:8] Message Buffer Status Changed n (n=64-95) (rh) */
    unsigned int MBC73:1;                   /**< \brief [9:9] Message Buffer Status Changed n (n=64-95) (rh) */
    unsigned int MBC74:1;                   /**< \brief [10:10] Message Buffer Status Changed n (n=64-95) (rh) */
    unsigned int MBC75:1;                   /**< \brief [11:11] Message Buffer Status Changed n (n=64-95) (rh) */
    unsigned int MBC76:1;                   /**< \brief [12:12] Message Buffer Status Changed n (n=64-95) (rh) */
    unsigned int MBC77:1;                   /**< \brief [13:13] Message Buffer Status Changed n (n=64-95) (rh) */
    unsigned int MBC78:1;                   /**< \brief [14:14] Message Buffer Status Changed n (n=64-95) (rh) */
    unsigned int MBC79:1;                   /**< \brief [15:15] Message Buffer Status Changed n (n=64-95) (rh) */
    unsigned int MBC80:1;                   /**< \brief [16:16] Message Buffer Status Changed n (n=64-95) (rh) */
    unsigned int MBC81:1;                   /**< \brief [17:17] Message Buffer Status Changed n (n=64-95) (rh) */
    unsigned int MBC82:1;                   /**< \brief [18:18] Message Buffer Status Changed n (n=64-95) (rh) */
    unsigned int MBC83:1;                   /**< \brief [19:19] Message Buffer Status Changed n (n=64-95) (rh) */
    unsigned int MBC84:1;                   /**< \brief [20:20] Message Buffer Status Changed n (n=64-95) (rh) */
    unsigned int MBC85:1;                   /**< \brief [21:21] Message Buffer Status Changed n (n=64-95) (rh) */
    unsigned int MBC86:1;                   /**< \brief [22:22] Message Buffer Status Changed n (n=64-95) (rh) */
    unsigned int MBC87:1;                   /**< \brief [23:23] Message Buffer Status Changed n (n=64-95) (rh) */
    unsigned int MBC88:1;                   /**< \brief [24:24] Message Buffer Status Changed n (n=64-95) (rh) */
    unsigned int MBC89:1;                   /**< \brief [25:25] Message Buffer Status Changed n (n=64-95) (rh) */
    unsigned int MBC90:1;                   /**< \brief [26:26] Message Buffer Status Changed n (n=64-95) (rh) */
    unsigned int MBC91:1;                   /**< \brief [27:27] Message Buffer Status Changed n (n=64-95) (rh) */
    unsigned int MBC92:1;                   /**< \brief [28:28] Message Buffer Status Changed n (n=64-95) (rh) */
    unsigned int MBC93:1;                   /**< \brief [29:29] Message Buffer Status Changed n (n=64-95) (rh) */
    unsigned int MBC94:1;                   /**< \brief [30:30] Message Buffer Status Changed n (n=64-95) (rh) */
    unsigned int MBC95:1;                   /**< \brief [31:31] Message Buffer Status Changed n (n=64-95) (rh) */
} Ifx_ERAY_MBSC3_Bits;

/** \\brief  Message Buffer Status Changed 4 */
typedef struct _Ifx_ERAY_MBSC4_Bits
{
    unsigned int MBC96:1;                   /**< \brief [0:0] Message Buffer Status Changed n (n=96-127) (rh) */
    unsigned int MBC97:1;                   /**< \brief [1:1] Message Buffer Status Changed n (n=96-127) (rh) */
    unsigned int MBC98:1;                   /**< \brief [2:2] Message Buffer Status Changed n (n=96-127) (rh) */
    unsigned int MBC99:1;                   /**< \brief [3:3] Message Buffer Status Changed n (n=96-127) (rh) */
    unsigned int MBC100:1;                  /**< \brief [4:4] Message Buffer Status Changed n (n=96-127) (rh) */
    unsigned int MBC101:1;                  /**< \brief [5:5] Message Buffer Status Changed n (n=96-127) (rh) */
    unsigned int MBC102:1;                  /**< \brief [6:6] Message Buffer Status Changed n (n=96-127) (rh) */
    unsigned int MBC103:1;                  /**< \brief [7:7] Message Buffer Status Changed n (n=96-127) (rh) */
    unsigned int MBC104:1;                  /**< \brief [8:8] Message Buffer Status Changed n (n=96-127) (rh) */
    unsigned int MBC105:1;                  /**< \brief [9:9] Message Buffer Status Changed n (n=96-127) (rh) */
    unsigned int MBC106:1;                  /**< \brief [10:10] Message Buffer Status Changed n (n=96-127) (rh) */
    unsigned int MBC107:1;                  /**< \brief [11:11] Message Buffer Status Changed n (n=96-127) (rh) */
    unsigned int MBC108:1;                  /**< \brief [12:12] Message Buffer Status Changed n (n=96-127) (rh) */
    unsigned int MBC109:1;                  /**< \brief [13:13] Message Buffer Status Changed n (n=96-127) (rh) */
    unsigned int MBC110:1;                  /**< \brief [14:14] Message Buffer Status Changed n (n=96-127) (rh) */
    unsigned int MBC111:1;                  /**< \brief [15:15] Message Buffer Status Changed n (n=96-127) (rh) */
    unsigned int MBC112:1;                  /**< \brief [16:16] Message Buffer Status Changed n (n=96-127) (rh) */
    unsigned int MBC113:1;                  /**< \brief [17:17] Message Buffer Status Changed n (n=96-127) (rh) */
    unsigned int MBC114:1;                  /**< \brief [18:18] Message Buffer Status Changed n (n=96-127) (rh) */
    unsigned int MBC115:1;                  /**< \brief [19:19] Message Buffer Status Changed n (n=96-127) (rh) */
    unsigned int MBC116:1;                  /**< \brief [20:20] Message Buffer Status Changed n (n=96-127) (rh) */
    unsigned int MBC117:1;                  /**< \brief [21:21] Message Buffer Status Changed n (n=96-127) (rh) */
    unsigned int MBC118:1;                  /**< \brief [22:22] Message Buffer Status Changed n (n=96-127) (rh) */
    unsigned int MBC119:1;                  /**< \brief [23:23] Message Buffer Status Changed n (n=96-127) (rh) */
    unsigned int MBC120:1;                  /**< \brief [24:24] Message Buffer Status Changed n (n=96-127) (rh) */
    unsigned int MBC121:1;                  /**< \brief [25:25] Message Buffer Status Changed n (n=96-127) (rh) */
    unsigned int MBC122:1;                  /**< \brief [26:26] Message Buffer Status Changed n (n=96-127) (rh) */
    unsigned int MBC123:1;                  /**< \brief [27:27] Message Buffer Status Changed n (n=96-127) (rh) */
    unsigned int MBC124:1;                  /**< \brief [28:28] Message Buffer Status Changed n (n=96-127) (rh) */
    unsigned int MBC125:1;                  /**< \brief [29:29] Message Buffer Status Changed n (n=96-127) (rh) */
    unsigned int MBC126:1;                  /**< \brief [30:30] Message Buffer Status Changed n (n=96-127) (rh) */
    unsigned int MBC127:1;                  /**< \brief [31:31] Message Buffer Status Changed n (n=96-127) (rh) */
} Ifx_ERAY_MBSC4_Bits;

/** \\brief  MHD Configuration Register */
typedef struct _Ifx_ERAY_MHDC_Bits
{
    unsigned int SFDL:7;                    /**< \brief [6:0] Static Frame Data Length (gPayloadLengthStatic)This bit can be updated in "DEFAULT_CONFIG" or "CONFIG" state only! (rw) */
    unsigned int reserved_7:9;              /**< \brief \internal Reserved */
    unsigned int SLT:13;                    /**< \brief [28:16] Start of Latest Transmit (pLatestTx) (rw) */
    unsigned int reserved_29:3;             /**< \brief \internal Reserved */
} Ifx_ERAY_MHDC_Bits;

/** \\brief  Message Handler Constraints Flags */
typedef struct _Ifx_ERAY_MHDF_Bits
{
    unsigned int SNUA:1;                    /**< \brief [0:0] Status Not Updated Channel A (rwh) */
    unsigned int SNUB:1;                    /**< \brief [1:1] Status Not Updated Channel B (rwh) */
    unsigned int FNFA:1;                    /**< \brief [2:2] Find Sequence Not Finished Channel A (rwh) */
    unsigned int FNFB:1;                    /**< \brief [3:3] Find Sequence Not Finished Channel B (rwh) */
    unsigned int TBFA:1;                    /**< \brief [4:4] Transient Buffer Access Failure A (rwh) */
    unsigned int TBFB:1;                    /**< \brief [5:5] Transient Buffer Access Failure B (rwh) */
    unsigned int TNSA:1;                    /**< \brief [6:6] Transmission Not Started Channel A (rwh) */
    unsigned int TNSB:1;                    /**< \brief [7:7] Transmission Not Started Channel B (rwh) */
    unsigned int WAHP:1;                    /**< \brief [8:8] Write Attempt to Header Partition (rwh) */
    unsigned int reserved_9:23;             /**< \brief \internal Reserved */
} Ifx_ERAY_MHDF_Bits;

/** \\brief  Message Handler Status */
typedef struct _Ifx_ERAY_MHDS_Bits
{
    unsigned int EIBF:1;                    /**< \brief [0:0] ECC Error Input Buffer RAM 1,2 (rwh) */
    unsigned int EOBF:1;                    /**< \brief [1:1] ECC Error Output Buffer RAM 1,2 (rwh) */
    unsigned int EMR:1;                     /**< \brief [2:2] ECC Error Message RAM (rwh) */
    unsigned int ETBF1:1;                   /**< \brief [3:3] ECC Error Transient Buffer RAM A (rwh) */
    unsigned int ETBF2:1;                   /**< \brief [4:4] ECC Error Transient Buffer RAM B (rwh) */
    unsigned int FMBD:1;                    /**< \brief [5:5] Faulty Message Buffer Detected (rwh) */
    unsigned int MFMB:1;                    /**< \brief [6:6] Multiple Faulty Message Buffers detected (rwh) */
    unsigned int CRAM:1;                    /**< \brief [7:7] Clear all internal RAM’s (rh) */
    unsigned int FMB:7;                     /**< \brief [14:8] Faulty Message Buffer (rh) */
    unsigned int reserved_15:1;             /**< \brief \internal Reserved */
    unsigned int MBT:7;                     /**< \brief [22:16] Message Buffer Transmitted (rh) */
    unsigned int reserved_23:1;             /**< \brief \internal Reserved */
    unsigned int MBU:7;                     /**< \brief [30:24] Message Buffer Updated (rh) */
    unsigned int reserved_31:1;             /**< \brief \internal Reserved */
} Ifx_ERAY_MHDS_Bits;

/** \\brief  Message RAM Configuration */
typedef struct _Ifx_ERAY_MRC_Bits
{
    unsigned int FDB:8;                     /**< \brief [7:0] First Dynamic Buffer (rw) */
    unsigned int FFB:8;                     /**< \brief [15:8] First Buffer of FIFO (rw) */
    unsigned int LCB:8;                     /**< \brief [23:16] Last Configured Buffer (rw) */
    unsigned int SEC:2;                     /**< \brief [25:24] Secure Buffers (rw) */
    unsigned int SPLM:1;                    /**< \brief [26:26] SYNC Frame Payload Multiplex (rw) */
    unsigned int reserved_27:5;             /**< \brief \internal Reserved */
} Ifx_ERAY_MRC_Bits;

/** \\brief  Message Buffer Status Changed Interrupt Control 1 */
typedef struct _Ifx_ERAY_MSIC1_Bits
{
    unsigned int MSIP0:1;                   /**< \brief [0:0] Message Buffer Status Changed Interrupt Pointern (n=0-31) (rw) */
    unsigned int MSIP1:1;                   /**< \brief [1:1] Message Buffer Status Changed Interrupt Pointern (n=0-31) (rw) */
    unsigned int MSIP2:1;                   /**< \brief [2:2] Message Buffer Status Changed Interrupt Pointern (n=0-31) (rw) */
    unsigned int MSIP3:1;                   /**< \brief [3:3] Message Buffer Status Changed Interrupt Pointern (n=0-31) (rw) */
    unsigned int MSIP4:1;                   /**< \brief [4:4] Message Buffer Status Changed Interrupt Pointern (n=0-31) (rw) */
    unsigned int MSIP5:1;                   /**< \brief [5:5] Message Buffer Status Changed Interrupt Pointern (n=0-31) (rw) */
    unsigned int MSIP6:1;                   /**< \brief [6:6] Message Buffer Status Changed Interrupt Pointern (n=0-31) (rw) */
    unsigned int MSIP7:1;                   /**< \brief [7:7] Message Buffer Status Changed Interrupt Pointern (n=0-31) (rw) */
    unsigned int MSIP8:1;                   /**< \brief [8:8] Message Buffer Status Changed Interrupt Pointern (n=0-31) (rw) */
    unsigned int MSIP9:1;                   /**< \brief [9:9] Message Buffer Status Changed Interrupt Pointern (n=0-31) (rw) */
    unsigned int MSIP10:1;                  /**< \brief [10:10] Message Buffer Status Changed Interrupt Pointern (n=0-31) (rw) */
    unsigned int MSIP11:1;                  /**< \brief [11:11] Message Buffer Status Changed Interrupt Pointern (n=0-31) (rw) */
    unsigned int MSIP12:1;                  /**< \brief [12:12] Message Buffer Status Changed Interrupt Pointern (n=0-31) (rw) */
    unsigned int MSIP13:1;                  /**< \brief [13:13] Message Buffer Status Changed Interrupt Pointern (n=0-31) (rw) */
    unsigned int MSIP14:1;                  /**< \brief [14:14] Message Buffer Status Changed Interrupt Pointern (n=0-31) (rw) */
    unsigned int MSIP15:1;                  /**< \brief [15:15] Message Buffer Status Changed Interrupt Pointern (n=0-31) (rw) */
    unsigned int MSIP16:1;                  /**< \brief [16:16] Message Buffer Status Changed Interrupt Pointern (n=0-31) (rw) */
    unsigned int MSIP17:1;                  /**< \brief [17:17] Message Buffer Status Changed Interrupt Pointern (n=0-31) (rw) */
    unsigned int MSIP18:1;                  /**< \brief [18:18] Message Buffer Status Changed Interrupt Pointern (n=0-31) (rw) */
    unsigned int MSIP19:1;                  /**< \brief [19:19] Message Buffer Status Changed Interrupt Pointern (n=0-31) (rw) */
    unsigned int MSIP20:1;                  /**< \brief [20:20] Message Buffer Status Changed Interrupt Pointern (n=0-31) (rw) */
    unsigned int MSIP21:1;                  /**< \brief [21:21] Message Buffer Status Changed Interrupt Pointern (n=0-31) (rw) */
    unsigned int MSIP22:1;                  /**< \brief [22:22] Message Buffer Status Changed Interrupt Pointern (n=0-31) (rw) */
    unsigned int MSIP23:1;                  /**< \brief [23:23] Message Buffer Status Changed Interrupt Pointern (n=0-31) (rw) */
    unsigned int MSIP24:1;                  /**< \brief [24:24] Message Buffer Status Changed Interrupt Pointern (n=0-31) (rw) */
    unsigned int MSIP25:1;                  /**< \brief [25:25] Message Buffer Status Changed Interrupt Pointern (n=0-31) (rw) */
    unsigned int MSIP26:1;                  /**< \brief [26:26] Message Buffer Status Changed Interrupt Pointern (n=0-31) (rw) */
    unsigned int MSIP27:1;                  /**< \brief [27:27] Message Buffer Status Changed Interrupt Pointern (n=0-31) (rw) */
    unsigned int MSIP28:1;                  /**< \brief [28:28] Message Buffer Status Changed Interrupt Pointern (n=0-31) (rw) */
    unsigned int MSIP29:1;                  /**< \brief [29:29] Message Buffer Status Changed Interrupt Pointern (n=0-31) (rw) */
    unsigned int MSIP30:1;                  /**< \brief [30:30] Message Buffer Status Changed Interrupt Pointern (n=0-31) (rw) */
    unsigned int MSIP31:1;                  /**< \brief [31:31] Message Buffer Status Changed Interrupt Pointern (n=0-31) (rw) */
} Ifx_ERAY_MSIC1_Bits;

