HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxEray_regdef.h
/** \\brief  Message Buffer Status Changed Interrupt Control 2 */
typedef struct _Ifx_ERAY_MSIC2_Bits
{
    unsigned int MSIP32:1;                  /**< \brief [0:0] Message Buffer Status Changed Interrupt Pointern (n=32-63) (rh) */
    unsigned int MSIP33:1;                  /**< \brief [1:1] Message Buffer Status Changed Interrupt Pointern (n=32-63) (rh) */
    unsigned int MSIP34:1;                  /**< \brief [2:2] Message Buffer Status Changed Interrupt Pointern (n=32-63) (rh) */
    unsigned int MSIP35:1;                  /**< \brief [3:3] Message Buffer Status Changed Interrupt Pointern (n=32-63) (rh) */
    unsigned int MSIP36:1;                  /**< \brief [4:4] Message Buffer Status Changed Interrupt Pointern (n=32-63) (rh) */
    unsigned int MSIP37:1;                  /**< \brief [5:5] Message Buffer Status Changed Interrupt Pointern (n=32-63) (rh) */
    unsigned int MSIP38:1;                  /**< \brief [6:6] Message Buffer Status Changed Interrupt Pointern (n=32-63) (rh) */
    unsigned int MSIP39:1;                  /**< \brief [7:7] Message Buffer Status Changed Interrupt Pointern (n=32-63) (rh) */
    unsigned int MSIP40:1;                  /**< \brief [8:8] Message Buffer Status Changed Interrupt Pointern (n=32-63) (rh) */
    unsigned int MSIP41:1;                  /**< \brief [9:9] Message Buffer Status Changed Interrupt Pointern (n=32-63) (rh) */
    unsigned int MSIP42:1;                  /**< \brief [10:10] Message Buffer Status Changed Interrupt Pointern (n=32-63) (rh) */
    unsigned int MSIP43:1;                  /**< \brief [11:11] Message Buffer Status Changed Interrupt Pointern (n=32-63) (rh) */
    unsigned int MSIP44:1;                  /**< \brief [12:12] Message Buffer Status Changed Interrupt Pointern (n=32-63) (rh) */
    unsigned int MSIP45:1;                  /**< \brief [13:13] Message Buffer Status Changed Interrupt Pointern (n=32-63) (rh) */
    unsigned int MSIP46:1;                  /**< \brief [14:14] Message Buffer Status Changed Interrupt Pointern (n=32-63) (rh) */
    unsigned int MSIP47:1;                  /**< \brief [15:15] Message Buffer Status Changed Interrupt Pointern (n=32-63) (rh) */
    unsigned int MSIP48:1;                  /**< \brief [16:16] Message Buffer Status Changed Interrupt Pointern (n=32-63) (rh) */
    unsigned int MSIP49:1;                  /**< \brief [17:17] Message Buffer Status Changed Interrupt Pointern (n=32-63) (rh) */
    unsigned int MSIP50:1;                  /**< \brief [18:18] Message Buffer Status Changed Interrupt Pointern (n=32-63) (rh) */
    unsigned int MSIP51:1;                  /**< \brief [19:19] Message Buffer Status Changed Interrupt Pointern (n=32-63) (rh) */
    unsigned int MSIP52:1;                  /**< \brief [20:20] Message Buffer Status Changed Interrupt Pointern (n=32-63) (rh) */
    unsigned int MSIP53:1;                  /**< \brief [21:21] Message Buffer Status Changed Interrupt Pointern (n=32-63) (rh) */
    unsigned int MSIP54:1;                  /**< \brief [22:22] Message Buffer Status Changed Interrupt Pointern (n=32-63) (rh) */
    unsigned int MSIP55:1;                  /**< \brief [23:23] Message Buffer Status Changed Interrupt Pointern (n=32-63) (rh) */
    unsigned int MSIP56:1;                  /**< \brief [24:24] Message Buffer Status Changed Interrupt Pointern (n=32-63) (rh) */
    unsigned int MSIP57:1;                  /**< \brief [25:25] Message Buffer Status Changed Interrupt Pointern (n=32-63) (rh) */
    unsigned int MSIP58:1;                  /**< \brief [26:26] Message Buffer Status Changed Interrupt Pointern (n=32-63) (rh) */
    unsigned int MSIP59:1;                  /**< \brief [27:27] Message Buffer Status Changed Interrupt Pointern (n=32-63) (rh) */
    unsigned int MSIP60:1;                  /**< \brief [28:28] Message Buffer Status Changed Interrupt Pointern (n=32-63) (rh) */
    unsigned int MSIP61:1;                  /**< \brief [29:29] Message Buffer Status Changed Interrupt Pointern (n=32-63) (rh) */
    unsigned int MSIP62:1;                  /**< \brief [30:30] Message Buffer Status Changed Interrupt Pointern (n=32-63) (rh) */
    unsigned int MSIP63:1;                  /**< \brief [31:31] Message Buffer Status Changed Interrupt Pointern (n=32-63) (rh) */
} Ifx_ERAY_MSIC2_Bits;

/** \\brief  Message Buffer Status Changed Interrupt Control 3 */
typedef struct _Ifx_ERAY_MSIC3_Bits
{
    unsigned int MSIP64:1;                  /**< \brief [0:0] Message Buffer Status Changed Interrupt Pointern (n=64-95) (rw) */
    unsigned int MSIP65:1;                  /**< \brief [1:1] Message Buffer Status Changed Interrupt Pointern (n=64-95) (rw) */
    unsigned int MSIP66:1;                  /**< \brief [2:2] Message Buffer Status Changed Interrupt Pointern (n=64-95) (rw) */
    unsigned int MSIP67:1;                  /**< \brief [3:3] Message Buffer Status Changed Interrupt Pointern (n=64-95) (rw) */
    unsigned int MSIP68:1;                  /**< \brief [4:4] Message Buffer Status Changed Interrupt Pointern (n=64-95) (rw) */
    unsigned int MSIP69:1;                  /**< \brief [5:5] Message Buffer Status Changed Interrupt Pointern (n=64-95) (rw) */
    unsigned int MSIP70:1;                  /**< \brief [6:6] Message Buffer Status Changed Interrupt Pointern (n=64-95) (rw) */
    unsigned int MSIP71:1;                  /**< \brief [7:7] Message Buffer Status Changed Interrupt Pointern (n=64-95) (rw) */
    unsigned int MSIP72:1;                  /**< \brief [8:8] Message Buffer Status Changed Interrupt Pointern (n=64-95) (rw) */
    unsigned int MSIP73:1;                  /**< \brief [9:9] Message Buffer Status Changed Interrupt Pointern (n=64-95) (rw) */
    unsigned int MSIP74:1;                  /**< \brief [10:10] Message Buffer Status Changed Interrupt Pointern (n=64-95) (rw) */
    unsigned int MSIP75:1;                  /**< \brief [11:11] Message Buffer Status Changed Interrupt Pointern (n=64-95) (rw) */
    unsigned int MSIP76:1;                  /**< \brief [12:12] Message Buffer Status Changed Interrupt Pointern (n=64-95) (rw) */
    unsigned int MSIP77:1;                  /**< \brief [13:13] Message Buffer Status Changed Interrupt Pointern (n=64-95) (rw) */
    unsigned int MSIP78:1;                  /**< \brief [14:14] Message Buffer Status Changed Interrupt Pointern (n=64-95) (rw) */
    unsigned int MSIP79:1;                  /**< \brief [15:15] Message Buffer Status Changed Interrupt Pointern (n=64-95) (rw) */
    unsigned int MSIP80:1;                  /**< \brief [16:16] Message Buffer Status Changed Interrupt Pointern (n=64-95) (rw) */
    unsigned int MSIP81:1;                  /**< \brief [17:17] Message Buffer Status Changed Interrupt Pointern (n=64-95) (rw) */
    unsigned int MSIP82:1;                  /**< \brief [18:18] Message Buffer Status Changed Interrupt Pointern (n=64-95) (rw) */
    unsigned int MSIP83:1;                  /**< \brief [19:19] Message Buffer Status Changed Interrupt Pointern (n=64-95) (rw) */
    unsigned int MSIP84:1;                  /**< \brief [20:20] Message Buffer Status Changed Interrupt Pointern (n=64-95) (rw) */
    unsigned int MSIP85:1;                  /**< \brief [21:21] Message Buffer Status Changed Interrupt Pointern (n=64-95) (rw) */
    unsigned int MSIP86:1;                  /**< \brief [22:22] Message Buffer Status Changed Interrupt Pointern (n=64-95) (rw) */
    unsigned int MSIP87:1;                  /**< \brief [23:23] Message Buffer Status Changed Interrupt Pointern (n=64-95) (rw) */
    unsigned int MSIP88:1;                  /**< \brief [24:24] Message Buffer Status Changed Interrupt Pointern (n=64-95) (rw) */
    unsigned int MSIP89:1;                  /**< \brief [25:25] Message Buffer Status Changed Interrupt Pointern (n=64-95) (rw) */
    unsigned int MSIP90:1;                  /**< \brief [26:26] Message Buffer Status Changed Interrupt Pointern (n=64-95) (rw) */
    unsigned int MSIP91:1;                  /**< \brief [27:27] Message Buffer Status Changed Interrupt Pointern (n=64-95) (rw) */
    unsigned int MSIP92:1;                  /**< \brief [28:28] Message Buffer Status Changed Interrupt Pointern (n=64-95) (rw) */
    unsigned int MSIP93:1;                  /**< \brief [29:29] Message Buffer Status Changed Interrupt Pointern (n=64-95) (rw) */
    unsigned int MSIP94:1;                  /**< \brief [30:30] Message Buffer Status Changed Interrupt Pointern (n=64-95) (rw) */
    unsigned int MSIP95:1;                  /**< \brief [31:31] Message Buffer Status Changed Interrupt Pointern (n=64-95) (rw) */
} Ifx_ERAY_MSIC3_Bits;

