HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxEray_regdef.h
/** \\brief  Message Buffer Status */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_MBS_Bits B;
} Ifx_ERAY_MBS;

/** \\brief  Message Buffer Status Changed 1 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_MBSC1_Bits B;
} Ifx_ERAY_MBSC1;

/** \\brief  Message Buffer Status Changed 2 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_MBSC2_Bits B;
} Ifx_ERAY_MBSC2;

/** \\brief  Message Buffer Status Changed 3 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_MBSC3_Bits B;
} Ifx_ERAY_MBSC3;

/** \\brief  Message Buffer Status Changed 4 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_MBSC4_Bits B;
} Ifx_ERAY_MBSC4;

/** \\brief  MHD Configuration Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_MHDC_Bits B;
} Ifx_ERAY_MHDC;

/** \\brief  Message Handler Constraints Flags */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_MHDF_Bits B;
} Ifx_ERAY_MHDF;

/** \\brief  Message Handler Status */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_MHDS_Bits B;
} Ifx_ERAY_MHDS;

/** \\brief  Message RAM Configuration */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_MRC_Bits B;
} Ifx_ERAY_MRC;

/** \\brief  Message Buffer Status Changed Interrupt Control 1 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_MSIC1_Bits B;
} Ifx_ERAY_MSIC1;

/** \\brief  Message Buffer Status Changed Interrupt Control 2 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_MSIC2_Bits B;
} Ifx_ERAY_MSIC2;

/** \\brief  Message Buffer Status Changed Interrupt Control 3 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_MSIC3_Bits B;
} Ifx_ERAY_MSIC3;

/** \\brief  Message Buffer Status Changed Interrupt Control 4 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_MSIC4_Bits B;
} Ifx_ERAY_MSIC4;

/** \\brief  Macrotick and Cycle Counter Value */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_MTCCV_Bits B;
} Ifx_ERAY_MTCCV;

/** \\brief  New Data Register 1 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_NDAT1_Bits B;
} Ifx_ERAY_NDAT1;

/** \\brief  New Data Register 2 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_NDAT2_Bits B;
} Ifx_ERAY_NDAT2;

/** \\brief  New Data Register 3 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_NDAT3_Bits B;
} Ifx_ERAY_NDAT3;

/** \\brief  New Data Register 4 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_NDAT4_Bits B;
} Ifx_ERAY_NDAT4;

/** \\brief  New Data Interrupt Control 1 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_NDIC1_Bits B;
} Ifx_ERAY_NDIC1;

/** \\brief  New Data Interrupt Control 2 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_NDIC2_Bits B;
} Ifx_ERAY_NDIC2;

/** \\brief  New Data Interrupt Control 3 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_NDIC3_Bits B;
} Ifx_ERAY_NDIC3;

/** \\brief  New Data Interrupt Control 4 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_NDIC4_Bits B;
} Ifx_ERAY_NDIC4;

/** \\brief  NEM Configuration Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_NEMC_Bits B;
} Ifx_ERAY_NEMC;

/** \\brief  Network Management Vector */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_NMV_Bits B;
} Ifx_ERAY_NMV;

/** \\brief  Output Buffer Command Mask */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_OBCM_Bits B;
} Ifx_ERAY_OBCM;

/** \\brief  Output Buffer Command Request */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_OBCR_Bits B;
} Ifx_ERAY_OBCR;

